BFS
截止2022-05-02

总共160道，非二叉树108道，二叉树52道，LCP-9题，剑指Offer-29题，面试题-6题



一、非二叉树类——108道
1.岛屿问题
	130.被围绕的区域
	200.岛屿数量
	1254.统计封闭岛屿的数量
	1020.飞地的数量
	695.岛屿的最大面积
	1905.统计子岛屿
	694.不同岛屿的数量


126. 单词接龙 II	
127. 单词接龙
133. 克隆图
207. 课程表
210. 课程表 II
279. 完全平方数		
301. 删除无效的括号
322. 零钱兑换
329. 矩阵中的最长递增路径	
365. 水壶问题
399. 除法求值	
407. 接雨水 II
417. 太平洋大西洋水流问题
433. 最小基因变化	
463. 岛屿的周长	
488. 祖玛游戏
514. 自由之路
529. 扫雷游戏	
542. 01 矩阵	
547. 省份数量	
672. 灯泡开关 Ⅱ
675. 为高尔夫比赛砍树
684. 冗余连接	
685. 冗余连接 II	
690. 员工的重要性
721. 账户合并	
733. 图像渲染
743. 网络延迟时间	
749. 隔离病毒	
752. 打开转盘锁
756. 金字塔转换矩阵
765. 情侣牵手	
773. 滑动谜题	
778. 水位上升的泳池中游泳
785. 判断二分图	
787. K 站中转内最便宜的航班
797. 所有可能的路径	
802. 找到最终的安全状态
815. 公交路线	
827. 最大人工岛	
839. 相似字符串组
841. 钥匙和房间	
847. 访问所有节点的最短路径
854. 相似度为 K 的字符串
864. 获取所有钥匙的最短路径
886. 可能的二分法	
909. 蛇梯棋
913. 猫和老鼠
924. 尽量减少恶意软件的传播
928. 尽量减少恶意软件的传播 II	
934. 最短的桥
959. 由斜杠划分区域
967. 连续差相同的数字
994. 腐烂的橘子
1034. 边界着色
1036. 逃离大迷宫	
1042. 不邻接植花
1091. 二进制矩阵中的最短路径
1096. 花括号展开 II	
1129. 颜色交替的最短路径	
1161. 最大层内元素和
1162. 地图分析	
1202. 交换字符串中的元素
1203. 项目管理	
1210. 穿过迷宫的最少移动次数	
1263. 推箱子
1267. 统计参与通信的服务器
1284. 转化为全零矩阵的最少反转次数	
1293. 网格中的最短路径	
1298. 你能从盒子里获得的最大糖果数	
1306. 跳跃游戏 III
1311. 获取你好友已观看的视频	
1319. 连通网络的操作次数
1345. 跳跃游戏 IV
1368. 使网格图至少有一条有效路径的最小代价
1376. 通知所有员工所需的时间
1377. T 秒后青蛙的位置
1391. 检查网格中是否存在有效路径
1430. 判断给定的序列是否是二叉树从根到叶的路径
1443. 收集树上所有苹果的最少时间
1462. 课程表 IV
1466. 重新规划路线
1469. 寻找所有的独生节点
1559. 二维网格图中探测环	
1568. 使陆地分离的最少天数
1625. 执行操作后字典序最小的字符串
1631. 最小体力消耗路径
1654. 到家的最少跳跃次数	
1728. 猫和老鼠 II
1765. 地图中的最高点	
1926. 迷宫中离入口最近的出口
1970. 你能穿过矩阵的最后一天
1971. 寻找图中是否存在路径
1992. 找到所有的农场组	
2039. 网络空闲的时刻	
2045. 到达目的地的第二短时间	
2059. 转化数字的最小运算数
2092. 找出知晓秘密的所有专家
2101. 引爆最多的炸弹	
2146. 价格范围内最高排名的 K 样物品	
2192. 有向无环图中一个节点的所有祖先


二、二叉树相关——52道
100. 相同的树	
101. 对称二叉树
102. 二叉树的层序遍历	
103. 二叉树的锯齿形层序遍历
104. 二叉树的最大深度	
107. 二叉树的层序遍历 II	
111. 二叉树的最小深度
112. 路径总和
116. 填充每个节点的下一个右侧节点指针
117. 填充每个节点的下一个右侧节点指针 II
199. 二叉树的右视图
226. 翻转二叉树
297. 二叉树的序列化与反序列化
310. 最小高度树		
404. 左叶子之和	
429. N 叉树的层序遍历
449. 序列化和反序列化二叉搜索树
513. 找树左下角的值	
515. 在每个树行中找最大值
530. 二叉搜索树的最小绝对差
559. N 叉树的最大深度	
617. 合并二叉树	
623. 在二叉树中增加一行	
637. 二叉树的层平均值	
653. 两数之和 IV - 输入 BST
655. 输出二叉树
662. 二叉树最大宽度
783. 二叉搜索树节点最小距离
863. 二叉树中所有距离为 K 的结点	
865. 具有所有最深节点的最小子树	
919. 完全二叉树插入器
958. 二叉树的完全性检验
965. 单值二叉树
987. 二叉树的垂序遍历
993. 二叉树的堂兄弟节点
1123. 最深叶节点的最近公共祖先
1261. 在受污染的二叉树中查找元素	
1302. 层数最深叶子节点的和	
1315. 祖父节点值为偶数的节点和	
1361. 验证二叉树	
1367. 二叉树中的列表
1379. 找出克隆二叉树中的相同节点	
1448. 统计二叉树中好节点的数目
1457. 二叉树中的伪回文路径
1483. 树节点的第 K 个祖先
1485. 克隆含随机指针的二叉树
1519. 子树中标签相同的节点数	
1609. 奇偶树	
1660. 纠正二叉树
1766. 互质树	
1993. 树上的操作
2196. 根据描述创建二叉树

LCP-9题
LCP 07. 传递信息
LCP 09. 最小跳跃次数	
LCP 13. 寻宝
LCP 21. 追逐游戏
LCP 31. 变换的迷宫
LCP 41. 黑白翻转棋	
LCP 44. 开幕式焰火	
LCP 45. 自行车炫技赛场
LCS 03. 主题空间

剑指Offer-29题
剑指 Offer 13. 机器人的运动范围
剑指 Offer 27. 二叉树的镜像
剑指 Offer 28. 对称的二叉树
剑指 Offer 32 - I. 从上到下打印二叉树
剑指 Offer 32 - II. 从上到下打印二叉树 II	
剑指 Offer 32 - III. 从上到下打印二叉树 III
剑指 Offer 37. 序列化二叉树
剑指 Offer 55 - I. 二叉树的深度
剑指 Offer II 043. 往完全二叉树添加节点	
剑指 Offer II 044. 二叉树每层的最大值
剑指 Offer II 045. 二叉树最底层最左边的值	
剑指 Offer II 046. 二叉树的右侧视图
剑指 Offer II 048. 序列化与反序列化二叉树	
剑指 Offer II 056. 二叉搜索树中两个节点之和	
剑指 Offer II 086. 分割回文子字符串
剑指 Offer II 103. 最少的硬币数目
剑指 Offer II 105. 岛屿的最大面积
剑指 Offer II 106. 二分图	
剑指 Offer II 107. 矩阵中的距离
剑指 Offer II 108. 单词演变
剑指 Offer II 109. 开密码锁
剑指 Offer II 110. 所有路径
剑指 Offer II 111. 计算除法
剑指 Offer II 112. 最长递增路径
剑指 Offer II 113. 课程顺序
剑指 Offer II 114. 外星文字典
剑指 Offer II 116. 省份数量	
剑指 Offer II 117. 相似的字符串
剑指 Offer II 118. 多余的边


面试题-6题
面试题 04.01. 节点间通路
面试题 04.03. 特定深度节点链表	
面试题 08.10. 颜色填充	
面试题 16.19. 水域大小	
面试题 17.07. 婴儿名字
面试题 17.22. 单词转换