DFS
截止2022-05-02

一、非二叉树类
130. 被围绕的区域
133. 克隆图
200. 岛屿数量
207. 课程表
210. 课程表 II
211. 添加与搜索单词 - 数据结构设计
329. 矩阵中的最长递增路径
332. 重新安排行程
337. 打家劫舍 III	
341. 扁平化嵌套列表迭代器
365. 水壶问题	
385. 迷你语法分析器	
386. 字典序排数
388. 文件的最长绝对路径	
399. 除法求值
417. 太平洋大西洋水流问题	
419. 甲板上的战舰		
430. 扁平化多级双向链表	
437. 路径总和 III	
463. 岛屿的周长
472. 连接词	
514. 自由之路
515. 在每个树行中找最大值
529. 扫雷游戏	
547. 省份数量
565. 数组嵌套	
672. 灯泡开关 Ⅱ	
684. 冗余连接	
685. 冗余连接 II
687. 最长同值路径
690. 员工的重要性	
695. 岛屿的最大面积		
721. 账户合并
733. 图像渲染	
743. 网络延迟时间
749. 隔离病毒
753. 破解保险箱	
756. 金字塔转换矩阵
765. 情侣牵手
778. 水位上升的泳池中游泳
785. 判断二分图
787. K 站中转内最便宜的航班	
797. 所有可能的路径
802. 找到最终的安全状态
827. 最大人工岛
839. 相似字符串组	
841. 钥匙和房间	
851. 喧闹和富有	
886. 可能的二分法
924. 尽量减少恶意软件的传播	
928. 尽量减少恶意软件的传播 II
934. 最短的桥
947. 移除最多的同行或同列石头	
959. 由斜杠划分区域	
1020. 飞地的数量
1034. 边界着色	
1036. 逃离大迷宫	
1042. 不邻接植花	
1161. 最大层内元素和	
1192. 查找集群内的「关键连接」
1202. 交换字符串中的元素
1203. 项目管理
1254. 统计封闭岛屿的数目	
1267. 统计参与通信的服务器
1306. 跳跃游戏 III
1319. 连通网络的操作次数	
1376. 通知所有员工所需的时间
1377. T 秒后青蛙的位置
1391. 检查网格中是否存在有效路径	
1462. 课程表 IV
1466. 重新规划路线
1559. 二维网格图中探测环
1568. 使陆地分离的最少天数
1600. 王位继承顺序		
1631. 最小体力消耗路径
1706. 球会落何处
1722. 执行交换操作后的最小汉明距离	
1905. 统计子岛屿	
1932. 合并多棵二叉搜索树
1970. 你能穿过矩阵的最后一天	
1971. 寻找图中是否存在路径
1992. 找到所有的农场组
2049. 统计最高分的节点数目
2092. 找出知晓秘密的所有专家
2097. 合法重新排列数对	
2101. 引爆最多的炸弹
2127. 参加会议的最多员工数
2192. 有向无环图中一个节点的所有祖先
2246. 相邻字符不同的最长路径


二、二叉树类
94. 二叉树的中序遍历	
98. 验证二叉搜索树	
99. 恢复二叉搜索树	
100. 相同的树
101. 对称二叉树
104. 二叉树的最大深度	
110. 平衡二叉树	
111. 二叉树的最小深度
112. 路径总和	
113. 路径总和 II	
114. 二叉树展开为链表
116. 填充每个节点的下一个右侧节点指针	
117. 填充每个节点的下一个右侧节点指针 II
124. 二叉树中的最大路径和
129. 求根节点到叶节点数字之和
144. 二叉树的前序遍历
145. 二叉树的后序遍历
156. 上下翻转二叉树
199. 二叉树的右视图
222. 完全二叉树的节点个数	
226. 翻转二叉树
230. 二叉搜索树中第K小的元素
235. 二叉搜索树的最近公共祖先
236. 二叉树的最近公共祖先
257. 二叉树的所有路径
297. 二叉树的序列化与反序列化		
310. 最小高度树	
404. 左叶子之和
449. 序列化和反序列化二叉搜索树	
501. 二叉搜索树中的众数	
508. 出现次数最多的子树元素和
513. 找树左下角的值
530. 二叉搜索树的最小绝对差	
538. 把二叉搜索树转换为累加树	
543. 二叉树的直径	
559. N 叉树的最大深度
563. 二叉树的坡度	
572. 另一棵树的子树
589. N 叉树的前序遍历	
590. N 叉树的后序遍历	
606. 根据二叉树创建字符串	
617. 合并二叉树	
623. 在二叉树中增加一行
637. 二叉树的层平均值
652. 寻找重复的子树	
653. 两数之和 IV - 输入 BST
655. 输出二叉树
662. 二叉树最大宽度
669. 修剪二叉搜索树
671. 二叉树中第二小的节点
783. 二叉搜索树节点最小距离	
834. 树中距离之和
814. 二叉树剪枝
863. 二叉树中所有距离为 K 的结点
865. 具有所有最深节点的最小子树
872. 叶子相似的树	
897. 递增顺序搜索树
938. 二叉搜索树的范围和	
951. 翻转等价二叉树	
965. 单值二叉树	
968. 监控二叉树	
971. 翻转二叉树以匹配先序遍历	
979. 在二叉树中分配硬币	
987. 二叉树的垂序遍历	
988. 从叶结点开始的最小字符串	
993. 二叉树的堂兄弟节点	
1022. 从根到叶的二进制数之和
1026. 节点与其祖先之间的最大差值	
1028. 从先序遍历还原二叉树
1038. 从二叉搜索树到更大和树
1080. 根到叶路径上的不足节点
1110. 删点成林		
1123. 最深叶节点的最近公共祖先
1145. 二叉树着色游戏
1261. 在受污染的二叉树中查找元素	
1302. 层数最深叶子节点的和	
1305. 两棵二叉搜索树中的所有元素
1315. 祖父节点值为偶数的节点和
1325. 删除给定值的叶子节点	
1339. 分裂二叉树的最大乘积	
1361. 验证二叉树
1367. 二叉树中的列表
1372. 二叉树中的最长交错路径
1373. 二叉搜索子树的最大键值和
1379. 找出克隆二叉树中的相同节点	
1382. 将二叉搜索树变平衡
1443. 收集树上所有苹果的最少时间	
1448. 统计二叉树中好节点的数目
1457. 二叉树中的伪回文路径
1483. 树节点的第 K 个祖先
1519. 子树中标签相同的节点数
1530. 好叶子节点对的数量
1766. 互质树	
2003. 每棵子树内缺失的最小基因值	
2096. 从二叉树一个节点到另一个节点每一步的方向
2196. 根据描述创建二叉树