回溯
截止2022-05-02

17. 电话号码的字母组合
22. 括号生成
37. 解数独	
39. 组合总和
40. 组合总和 II	
46. 全排列
47. 全排列 II
51. N 皇后
52. N皇后 II
77. 组合	
78. 子集
79. 单词搜索
89. 格雷编码
90. 子集 II
93. 复原 IP 地址
95. 不同的二叉搜索树 II
113. 路径总和 II	
126. 单词接龙 II
131. 分割回文串	
140. 单词拆分 II
212. 单词搜索 II
216. 组合总和 III
257. 二叉树的所有路径
282. 给表达式添加运算符
301. 删除无效的括号	
306. 累加数
357. 统计各位数字都不同的数字个数
401. 二进制手表
473. 火柴拼正方形	
491. 递增子序列	
494. 目标和	
526. 优美的排列
638. 大礼包
679. 24 点游戏
691. 贴纸拼词	
698. 划分为k个相等的子集	
784. 字母大小写全排列	
797. 所有可能的路径
816. 模糊坐标
842. 将数组拆分成斐波那契序列
967. 连续差相同的数字
980. 不同路径 III	
996. 正方形数组的数目
1079. 活字印刷	
1096. 花括号展开 II
1219. 黄金矿工	
1238. 循环码排列
1239. 串联字符串的最大长度	
1240. 铺瓷砖	
1255. 得分最高的单词集合	
1286. 字母组合迭代器
1307. 口算难题
1415. 长度为 n 的开心字符串中字典序第 k 小的字符串
1467. 两个盒子中球的颜色数相同的概率	
1593. 拆分字符串使唯一子字符串的数目最大
1601. 最多可达成的换楼请求数目
1655. 分配重复整数	
1718. 构建字典序最大的可行序列
1723. 完成所有工作的最短时间	
1774. 最接近目标价格的甜点成本
1799. N 次操作后的最大分数和
1849. 将字符串拆分为递减的连续值
1863. 找出所有子集的异或总和再求和	
1947. 最大兼容性评分和
1980. 找出不同的二进制字符串	
1986. 完成任务的最少工作时间段
2002. 两个回文子序列长度的最大乘积
2014. 重复 K 次的最长子序列	
2044. 统计按位或能得到最大值的子集数目
2048. 下一个更大的数值平衡数	
2056. 棋盘上有效移动组合的数目
2065. 最大化一张图中的路径价值	
2151. 基于陈述统计最多好人数