截至2246题
日期：2022年5月2号

树158道，剑指offer14道，面试题10道

第一类-遍历-31道
	二叉树遍历-20道
		94.中序遍历(10min)
		144.前序遍历(10min)
		145.后序遍历(10min)
		102.层次遍历(10min)(层数/完全二叉树/满二叉树暂时归类到这里)
		107.层次遍历II(10min)
		103.Z字形遍历(10min)
			116.填充每个节点的下一个右侧节点指针(不会，再看看)
			117.填充每个节点的下一个右侧节点指针II(不会，再看看)
			199.二叉树的右视图(10min)
			513.找树左下角的值(10min)
			515.在每个树行中找最大值(10min)
			637.二叉树的层平均值(10min)
			1302.层数最深叶子节点的和(10min)

			662.二叉树最大宽度(完全二叉树)
			222.完全二叉树的节点个数
			894.所有可能的满二叉树(满二叉树)
			919.完全二叉树插入器(完全二叉树)
			958.二叉树的完全性检验(完全二叉树)			
			987.二叉树的垂序遍历

	N叉树的遍历-3道
		429.N叉树的层序遍历
		590.N叉树的后序遍历		
		589.N叉树的前序遍历
	遍历与构造-8道
		105.从前序与中序遍历序列构造二叉树
		106.从中序与后序遍历序列构造二叉树
		889.从前序与后序遍历序列构造二叉树
		654.最大二叉树
		998.最大二叉树II
		655.输出二叉树
		1008.先序遍历构造二叉树
		1130.叶值最小代价生成树


第二类-二叉树的对称，翻转，镜像，子结构-18道

	子结构-7道
		100.相同的树	
		101.对称二叉树
		965.单值二叉树
		剑指 Offer 26. 树的子结构
		572.另一个树的子树
		814. 二叉树剪枝
		1367. 二叉树中的列表
		404.左叶子之和(10min)


	翻转-5道
		226.翻转二叉树
		951. 翻转等价二叉树
		971. 翻转二叉树以匹配先序遍历(有点难)
		1104.二叉树寻路
		617.合并二叉树

	序列化-6道
		449.序列化和反序列化二叉搜索树
		297.二叉树的序列化与反序列化(难题)
		331.验证二叉树的前序序列化 
		652.寻找重复的子树
		427.建立四叉树
		558.四叉树交集


第三类-深度及路径问题-28道
	深度问题
		104.二叉树的最大深度
		111.二叉树的最小深度
		110.平衡二叉树
		
		559.N叉树的最大深度
		865.具有所有最深结点的最小子树/1123.最深叶节点的最近公共祖先
		235.二叉搜索树的最近公共祖先
		236.二叉树的最近公共祖先
		1123.最深叶节点的最近公共祖先
		993.二叉树的堂兄弟节点


	根到叶节点路径
		112.路径总和
		113.路径总和II（DFS，BFS）
		437.路径总和III（DFS，前缀和）
		257.二叉树的所有路径(DFS，BFS)
		513.找树左下角的值
		508.出现次数最大的子树元素和
		563.二叉树的坡度
		606.根据二叉树创建字符串
		623.在二叉树中增加一行(DFS，BFS)
		979.在二叉树中分配硬币(DFS)

		872.叶子相似的树(如何将递归写出非递归形式)
		988.从叶节点开始的最小字符串(DFS和回溯的区别)

		671.二叉树中第二小的节点


	任意路径
		124.二叉树中最大路径和(任意结点)
		543.二叉树的直径(任意结点)
		687.最长同值路径(任意结点)
		863.二叉树中所有距离为K的结点
	
	129.求根到叶子节点数字之和(与1022相同)
	1022.从根到叶的二进制数之和
	

第四类-二叉搜索树-22道
	95.不同的二叉搜索树II(动态规划)
	96.不同的二叉搜索树(动态规划)
	
	98.验证二叉搜索树(中序遍历)
	99.恢复二叉搜索树(莫里斯遍历)
	230.二叉搜索树的第K小的元素(中序遍历)

	108.有序数组转二叉搜索树
	109.有序链表转二叉搜索树

	114.二叉树展开为链表
	897.递增顺序搜索树
	
	173.二叉搜索树迭代器
	538.把二叉搜索树转换为累加树
	1038.把二叉搜索树转换为累加树
	
	530.二叉搜索树的最小绝对差
	669.修剪二叉搜索树
	700.二叉搜索树中的搜索
	701.二叉搜索树中的插入操作
	783.二叉搜索树结点最小距离
	938.二叉搜索树的范围和
	1305.两棵二叉搜索树中的所有元素
	653.两数之和IV-输入BST
	450.删除二叉搜索树中的节点
	501.二叉搜索树中的众数

第五类、设计数据结构-5道
	173.二叉搜索树迭代器
	341.扁平化嵌套列表迭代器
	919.完全二叉树插入器
	1261.在受污染的二叉树中查找元素
	703.数据流中的第K大元素

第六类、树与其他结构的难题-5道
	二叉树+动态规划
		337.打家劫舍III
		968.监控二叉树
	二叉树+图
		684.冗余连接
		685.冗余连接II
		834.树中距离之和(难题，图)

====================================================================
未完成-39道
1026.节点与其祖先之间的最大差值
1028.从先序遍历还原二叉树
1080.根到叶路径上的不足节点
1110.删点成林
1315.祖父节点值为偶数的节点和
1145.二叉树着色游戏
1161.最大层内元素和
1261.在受污染的二叉树中查找元素
1325.删除给定值的叶子节点
1339.分裂二叉树的最大乘积
1361.验证二叉树
1367. 二叉树中的列表
1372. 二叉树中的最长交错路径
1373.二叉搜索子树的最大键值和
1376.通知所有员工所需的时间
1377.T秒后青蛙的位置
1379. 找出克隆二叉树中的相同节点
1382.将二叉搜索树变平衡
1443. 收集树上所有苹果的最少时间
1448. 统计二叉树中好节点的数目
1457. 二叉树中的伪回文路径
1466. 重新规划路线
1483.树节点的第K个祖先
1519.子树中标签相同的节点数
1530.好叶子节点对的数量
1569.将子数组重新排序得到同一个二叉查找树的方案数
1600.皇位继承顺序
1609.奇偶树
1719.重构一棵树的方案数
1766.互质树
1916.统计为蚁群构筑房间的不同顺序
1932.合并多棵二叉搜索树
1993.树上的操作
2003.每棵子树内缺失的最小基因值
2049.统计最高分的节点数目
2096.从二叉树一个节点到另一个节点每一步的方向
2196. 根据描述创建二叉树	
2236. 判断根结点是否等于子结点之和	
2246. 相邻字符不同的最长路径

剑指 Offer 14道
剑指 Offer 07. 重建二叉树
剑指 Offer 26. 树的子结构
剑指 Offer 27. 二叉树的镜像
剑指 Offer 28. 对称的二叉树
剑指 Offer 32 - I. 从上到下打印二叉树
剑指 Offer 32 - II. 从上到下打印二叉树 II
剑指 Offer 32 - III. 从上到下打印二叉树 III
剑指 Offer 34. 二叉树中和为某一值的路径
剑指 Offer 37. 序列化二叉树
剑指 Offer 54. 二叉搜索树的第k大节点	
剑指 Offer 55 - I. 二叉树的深度
剑指 Offer 55 - II. 平衡二叉树
剑指 Offer 68 - I. 二叉搜索树的最近公共祖先
剑指 Offer 68 - II. 二叉树的最近公共祖先


面试题-10道
面试题 04.02. 最小高度树
面试题 04.03. 特定深度节点链表
面试题 04.04. 检查平衡性
面试题 04.05. 合法二叉搜索树
面试题 04.06. 后继者
面试题 04.08. 首个共同祖先
面试题 04.09. 二叉搜索树序列
面试题 04.10. 检查子树
面试题 04.12. 求和路径
面试题 17.12. BiNode




















